Revit 2015 API
SpaceTagTypeSet.Erase Method
Removes a specified space tag type from the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual int Erase(
	SpaceTagType item
)
Visual Basic
Public Overridable Function Erase ( _
	item As SpaceTagType _
) As Integer
Visual C++
public:
virtual int Erase(
	SpaceTagType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Mechanical.SpaceTagType
The space tag type to be erased.
Return Value
The number of space tag types that were erased from the set.
See Also
SpaceTagTypeSet Class
Autodesk.Revit.DB.Mechanical Namespace